app/Views/web/include/footer.php

<?php
$contact_detail = json_decode($db->table('setting')->getWhere(["name"=>'main',])->getRow()->data);
---
SELECT *
FROM `setting`
WHERE `name` = 'main'