app/Views/web/include/header.php

SELECT *
FROM `setting`
WHERE `name` = 'main'
---
$uri = false;
if(!empty(explode($base_url, $url)[1]))	$uri = true;

$contact_detail = json_decode($db->table('setting')->getWhere(["name"=>'main',])->getRow()->data);

SELECT *
FROM `service_category`
WHERE `status` = 1
---
									<a href="<?=$base_url ?>#">Other Services <i class="fas fa-chevron-down"></i></a>

									<?php
									$serviceCategory = $db->table("service_category")->where(["status"=>1,])->get()->getResult();

SELECT *
FROM `service`
WHERE `status` = 1
AND `category` = '13'
 LIMIT 10
---
											<li class="has-submenu">
												<a href="<?=$base_url.$value->slug ?>"><?=$value->name ?></a>
												<?php
													$services = $db->table("service")->where(["status"=>1,"category"=>$value->id,])->limit(10)->get()->getResult();