app/Helpers/My_helper.php

SELECT *
FROM `role`
WHERE `id` = '3'
ORDER BY `name` ASC
---
  function get_role_by_id($role_id)
  {
    $db = db_connect();
    $data = $db->table("role")->orderBy("name","asc")->where(["id"=>$role_id,])->get()->getRow();