app/Helpers/My_helper.php

DELETE FROM `slugs`
WHERE `table_name` = 'service'
AND `p_id` = 124
SELECT *
FROM `slugs`
WHERE `slug` = 'business-and-corporate-law'
INSERT INTO `slugs` (`slug`, `table_name`, `p_id`, `page_name`) VALUES ('business-and-corporate-law', 'service', 124, 'single-service.php')
---
  function insert_slug($slug, $p_id, $table_name, $page_name = '')
  {
      $db = \Config\Database::connect();

      $data = [
          "slug"       => $slug,
          "table_name" => $table_name,
          "p_id"       => $p_id,
          "page_name"  => $page_name,
      ];

      // Delete existing slug for this table and ID
      $db->table("slugs")->where(["table_name" => $table_name, "p_id" => $p_id])->delete();

      // Check if the slug already exists
      $existingSlug = $db->table("slugs")->where("slug", $slug)->get()->getRow();

      if (!$existingSlug) {
          // If slug does not exist, insert it
          $db->table("slugs")->insert($data);

DELETE FROM `meta_tags`
WHERE `slug` = 'business-and-corporate-law'
INSERT INTO `meta_tags` (`page_name`, `meta_title`, `slug`, `meta_author`, `meta_keywords`, `meta_description`, `status`) VALUES ('Business and Corporate Law', 'Business and Corporate Law', 'business-and-corporate-law', '', '', '', 1)
---
  function insert_meta_tag($slug, $name)
  {
      $db = \Config\Database::connect();
      $request = \Config\Services::request();
      $meta_data = [
          "page_name"        => $name,
          "meta_title"       => $name,
          "slug"             => $slug,
          "meta_author"      => $request->getPost('meta_author') ?? '',
          "meta_keywords"    => $request->getPost('meta_keywords') ?? '',
          "meta_description" => $request->getPost('meta_description') ?? '',
          "status"           => 1,
      ];

      try {
          $db->table("meta_tags")->where("slug", $slug)->delete();
          if ($db->table("meta_tags")->insert($meta_data)) {

SELECT `users`.*, `countries`.`name` as `country_name`, `states`.`name` as `state_name`
FROM `users`
LEFT JOIN `countries` ON `countries`.`id` = `users`.`country`
LEFT JOIN `states` ON `states`.`id` = `users`.`state`
WHERE `users`.`id` = '17'
---
  function get_user()
  {
    $session = session()->get('user');
    if(!empty($session))
    {
      $user_id = $session['id'];
      $db = db_connect();
      return $user = $db->table('users')->where('users.id', $user_id)
      ->join('countries', 'countries.id = ' . 'users.country', 'left')
      ->join('states', 'states.id = ' . 'users.state', 'left')
      ->select("users.*, countries.name as country_name, states.name as state_name ")
      ->get()->getRow();

SELECT *
FROM `role`
WHERE `id` = '3'
ORDER BY `name` ASC
---
  function get_role_by_id($role_id)
  {
    $db = db_connect();
    $data = $db->table("role")->orderBy("name","asc")->where(["id"=>$role_id,])->get()->getRow();