app/Controllers/AuthBackend.php

UPDATE `login_history` SET `status` = 0
WHERE `user_id` = '17'
AND `status` = 1
---
    public function logout()
    {
        $db = db_connect();
        $session = session()->get('user');
        $user_id = $session['id'];
        $role = $session['role'];
        $db->table('login_history')->where(['user_id'=>$user_id,'status'=>1,])->update(['status'=>0,]);