app/Controllers/AuthUser.php

        ];

        // Update the login status of any previous sessions for the user
        $this->db->table('login_history')
            ->where(['user_id' => $user->id, 'status' => 1])
            ->update(['status' => 0]);

        // Insert new login history record
        if ($this->db->table('login_history')->insert($login_detail)) {
            // Get role data
            $role = $this->db->table('role')
                ->where('id', $user->role)
                ->get()
                ->getRow();
---
UPDATE `login_history` SET `status` = 0
WHERE `user_id` = '3'
AND `status` = 1
INSERT INTO `login_history` (`user_id`, `role`, `ip_address`, `date`, `time`, `status`, `device_id`, `password`, `firebase_token`, `access_token`) VALUES ('3', '2', '::1', '2025-07-29', '01:10:28', 1, '', 'e10adc3949ba59abbe56e057f20f883e', NULL, '')
SELECT *
FROM `role`
WHERE `id` = '2'

    public function login_action()
    {
        // Get username and password from POST request
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        // Query the user from the database
        $user = $this->db->table('users')
            ->where(['email' => $username])
            ->whereIn('role', [2,3])
            ->get()
            ->getRow();
---
SELECT *
FROM `users`
WHERE `email` = 'user@gmail.com'
AND `role` IN (2,3)

        } else {
            // Get role data
            $role = $user->role;
            $roledata = $this->db->table('role')
                ->where('id', $role)
                ->get()
                ->getRow();
---
SELECT *
FROM `role`
WHERE `id` = '2'

            $this->token_session($user);

            // Check login history
            $login_detail = $this->db->table('login_history')
                ->orderBy('id', 'desc')
                ->where(['user_id' => $user->id, 'status' => 1])
                ->get()
                ->getRow();
---
SELECT *
FROM `login_history`
WHERE `user_id` = '3'
AND `status` = 1
ORDER BY `id` DESC