app/Controllers/BaseController.php

            if(count($checkStateCity)>1)
            {
                $stateCity = decodeSlug($checkStateCity[1]);
                $emptyCehck1 = $this->db->table('states')->where("name", $stateCity)->get()->getRow();
                $emptyCehck2 = $this->db->table('city')->where("name", $stateCity)->get()->getRow();
---
SELECT *
FROM `states`
WHERE `name` = 'A N Islands'
SELECT *
FROM `city`
WHERE `name` = 'A N Islands'

        }

        // Check if the slug exists in the database
        $slug_data = $this->db->table("slugs")
            ->where("slug", $url)
            ->get()
            ->getResultObject();
---
SELECT *
FROM `slugs`
WHERE `slug` = 'partner'

        $data['p_id'] = $p_id;


        $data['contact_detail'] = json_decode($this->db->table('setting')->getWhere(["name"=>'main',])->getRow()->data);
        $data['policy'] = json_decode($this->db->table('setting')->getWhere(["name"=>'policy',])->getRow()->data);
        $data['logo'] = json_decode($this->db->table('setting')->getWhere(["name"=>'logo',])->getRow()->data);
---
SELECT *
FROM `setting`
WHERE `name` = 'main'
SELECT *
FROM `setting`
WHERE `name` = 'policy'
SELECT *
FROM `setting`
WHERE `name` = 'logo'

        $data['slug'] = $slug;
        $data['id'] = 0;
        $data['stateCity'] = $stateCity ? ' In '.$stateCity : $stateCity;
        $data['script'] = $this->db->table('script')->get()->getRow();
---
SELECT *
FROM `script`



        $meta_select = "page_name, meta_title, meta_keywords, meta_description, meta_author";
        $meta_data = $this->db->table("meta_tags")->select($meta_select)->where("slug", $url)->get()->getResultObject();
---
SELECT `page_name`, `meta_title`, `meta_keywords`, `meta_description`, `meta_author`
FROM `meta_tags`
WHERE `slug` = 'user'