app/Controllers/Home.php

    public function search_country($value='')
    {
        $search = $this->request->getVar('search');
        $table_name = 'countries';
        $builder = $this->db->table($table_name)->where("{$table_name}.status", 1);
        if (!empty($search)) {
            $builder->groupStart()->like("{$table_name}.name", $search)->groupEnd();
        }
        $data_list = $builder->orderBy("{$table_name}.id", 'desc')->limit(50, 0)->get()->getResult();
---
SELECT *
FROM `countries`
WHERE `countries`.`status` = 1
AND   (
`countries`.`name` LIKE '%indi%' ESCAPE '!'
 )
ORDER BY `countries`.`id` DESC
 LIMIT 50