app/Views/user/profile/form.php

SELECT *
FROM `countries`
WHERE `id` = '99'
---
													<select class="form-control" id="country" required name="country">
														<option value="">Select Country</option>
														<?php
														$country = $db->table("countries")->where(["id"=>$user->country,])->get()->getFirstRow();

SELECT *
FROM `states`
WHERE `id` = '25'
---
													<select class="form-control" id="state" required name="state">
														<option value="">Select State</option>
														<?php
														$country = $db->table("states")->where(["id"=>$user->state,])->get()->getFirstRow();