app/Controllers/Partner/PartnerKycController.php

    public function update()
    {
        $session = session()->get('user');
        $add_by = $session['id'];
        $id = $add_by;
        $user_id = $add_by;

        $lastKyc = $this->db->table('kyc')->where(["user_id"=>$user_id,])->orderBy('id','desc')->get()->getFirstRow();
        $user = $this->db->table('users')->where(["id"=>$user_id,])->orderBy('id','desc')->get()->getFirstRow();
---
SELECT *
FROM `kyc`
WHERE `user_id` = '17'
ORDER BY `id` DESC
SELECT *
FROM `users`
WHERE `id` = '17'
ORDER BY `id` DESC




        if($this->db->table('kyc')->insert($data))
---
INSERT INTO `kyc` (`user_id`, `bank_holder_name`, `nomani`, `bank_name`, `account_number`, `account_type`, `ifsc`, `pan`, `rg_mobile`, `rg_email`, `address`, `bar_number`, `enrollment_year`, `practicing_court`, `membership_number`, `firm_name`, `appointment_amount`, `experience`, `status`, `add_by`, `is_delete`) VALUES ('17', 'fafasf', 'safsa', 'jkh', 'jk', 'Saving', 'sfajh', 'hjkhjk', '543543', 'jkh', 'jkh', 'jk', '0000', 'h', NULL, 'jkh', '10', '20', 0, '17', 0)

                }
            }
            if(!empty($update_data))
            $this->db->table('kyc')->where('id',$insertID)->update($update_data);
---
UPDATE `kyc` SET `license` = '[{\"image_name\":\"banner3.jpg\",\"image_path\":\"175284894540license.jpg\",\"image_alt_text\":\"\"}]'
WHERE `id` = 54