app/Views/web/partner-profile.php

SELECT `users`.*, `role`.`name` as `role_name`, `countries`.`name` as `country_name`, `states`.`name` as `state_name`
FROM `users`
LEFT JOIN `role` ON `role`.`id` = `users`.`role`
LEFT JOIN `countries` ON `countries`.`id` = `users`.`country`
LEFT JOIN `states` ON `states`.`id` = `users`.`state`
WHERE `users`.`id` = '21'
AND `users`.`status` = 1
---

$user_id = decript($uri2);

$row = $db->table("users")->where(['users.id'=>$user_id,"users.status"=>1,])
->join('role',"role.id = users.role",'left')
->join('countries',"countries.id = users.country",'left')
->join('states',"states.id = users.state",'left')
->select("users.*, role.name as role_name, countries.name as country_name, states.name as state_name")
->get()->getFirstRow();

SELECT *
FROM `kyc`
WHERE `user_id` = '21'
ORDER BY `id` DESC
SELECT *
FROM `partner_education`
LEFT JOIN `education` as `education` ON `partner_education`.`ed_id` = `education`.`id`
WHERE `partner_education`.`user_id` = '21'
SELECT *
FROM `partner_specialization`
LEFT JOIN `service` as `service` ON `partner_specialization`.`sp_id` = `service`.`id`
WHERE `partner_specialization`.`user_id` = '21'
SELECT *
FROM `partner_service`
LEFT JOIN `service` as `service` ON `partner_service`.`s_id` = `service`.`id`
WHERE `partner_service`.`user_id` = '21'
SELECT *
FROM `partner_expertise`
LEFT JOIN `service` as `service` ON `partner_expertise`.`e_id` = `service`.`id`
WHERE `partner_expertise`.`user_id` = '21'
SELECT *
FROM `partner_certification`
LEFT JOIN `certification` as `certification` ON `partner_certification`.`c_id` = `certification`.`id`
WHERE `partner_certification`.`user_id` = '21'
---

	$user_id = $row->id;

	$kyc = $db->table('kyc')->where(["user_id"=>$user_id,])->orderBy('id','desc')->get()->getFirstRow();

	$educations = $db->table("partner_education")
	->where(['partner_education.user_id'=>$user_id,])
	->join('education as education',"partner_education.ed_id = education.id",'left')->get()->getResultObject();

	$partner_specialization = $db->table("partner_specialization")
	->where(['partner_specialization.user_id'=>$user_id,])
	->join('service as service',"partner_specialization.sp_id = service.id",'left')->get()->getResultObject();

	$partner_service = $db->table("partner_service")
	->where(['partner_service.user_id'=>$user_id,])
	->join('service as service',"partner_service.s_id = service.id",'left')->get()->getResultObject();

	$partner_expertise = $db->table("partner_expertise")
	->where(['partner_expertise.user_id'=>$user_id,])
	->join('service as service',"partner_expertise.e_id = service.id",'left')->get()->getResultObject();

	$partner_certification = $db->table("partner_certification")
	->where(['partner_certification.user_id'=>$user_id,])
	->join('certification as certification',"partner_certification.c_id = certification.id",'left')->get()->getResultObject();