app/Views/web/single-service.php

SELECT *
FROM `service_category`
WHERE `id` = '13'
SELECT *
FROM `service`
WHERE `status` = 1
AND `category` = '13'
SELECT *
FROM `service`
WHERE `status` = 1
AND `category` = '13'
 LIMIT 6
SELECT *
FROM `states`
WHERE `status` = 1
SELECT *
FROM `city`
WHERE `status` = 1
---
<?php include"include/header.php";
$category = $db->table('service_category')->where(["id"=>$row->category,])->get()->getRow();
$services = $db->table('service')->getWhere(["status"=>1,"category"=>$row->category,])->getResultObject();
$servicesCard = $db->table('service')->limit(6)->getWhere(["status"=>1,"category"=>$row->category,])->getResultObject();
$states = $db->table('states')->getWhere(["status"=>1,])->getResultObject();
$cities = $db->table('city')->getWhere(["status"=>1,])->getResultObject();